<?php
/**
 *
 * User: nintenichi
 * Date: 2019-08-08 16:52
 * Email: <rentianyi@homme-inc.com>
 */

namespace ZhijiaCommon\Component;

use ZhijiaCommon\Exceptions\Base\ApiException;
use Exception;

/**
 * Trait ErrorCode
 * @package ZhijiaCommon\Component
 */
trait ErrorCode
{
    //基础请求
    public static $errorCodeList = [
        200 => [200, '成功'],
        403 => [403, '权限不足'],
        404 => [404, '未找到页面'],
    ];
    //通用模块
    public static $errorCodeCommonList = [
        1001 => [1001, '必要参数不可为空'],
        1002 => [1002, '未找到相关数据'],
        1003 => [1003, '删除失败，请重新尝试'],
        1004 => [1004, '添加失败，请重新尝试'],
        1005 => [1005, '编辑失败，请重新尝试'],
        1006 => [1006, '您尚未进行修改任何'],
        1007 => [1007, '参数错误'],
        2001 => [2001, '用户数据过期，请重新登陆'],
        2002 => [2002, '缺少token参数'],
        2003 => [2003, '验证系统异常，请检查'],
        2004 => [2004, '上传文件不能为空'],
        2005 => [2005, '七牛云请求异常'],
        2006 => [2006, '文件扩展名不符，请重新上传'],
        2007 => [2007, '单文件大小超过文件上传最大限制（3MB）'],
        2008 => [2008, '验证码失效'],
        2009 => [2009, '验证码错误'],
    ];
    ///供应商管理服务从10001开始
    public static $errorCodeSupplierList = [
        10001 => [10001, '供应商数据保存失败，请稍后再试'],
        10002 => [10002, '供应商名称已存在，不可重复添加'],
        10003 => [10003, '供应商已存在，请检查修改的供应商名称'],
        10004 => [10004, '月结供应商数量为0'],
        10005 => [10005, 'Order服务：月结供应商当前订单数量为空'],
        10006 => [10006, 'Order服务：供应商的数据为空'],
        10007 => [10007, '修改供应商结算状态失败，请稍后再试'],
        10008 => [10008, '供应商不存在'],
        //添加品牌模块
        10101 => [10101, '品牌数据保存失败'],
        10102 => [10102, '品牌已经存在，不可重复添加'],
        //参数合法模块
        15000 => [15000, '参数错误：type'],
    ];
    ///订单服务从20001开始
    public static $errorCodeOrderList = [
        20001 => [20001, '您已提交订单，请勿重复提交'],
    ];
    ///商品服务从30001开始
    public static $errorCodeGoodsList = [
        30001 => [30001, '商品数据保持失败，请稍后再试'],
        30002 => [30002, '未查找到相关商品信息'],
    ];
    ///用户服务从40001开始
    public static $errorCodeUserList = [
        40001 => [40001, '用户数据保持失败，请稍后再试'],
        40002 => [40002,'手机号或验证码错误'],
        40003 => [40003,'账号信息错误'],
        40004 => [40004,'绑定失败'],
        40005 => [40005,'已绑定其他账户'],
        40006 => [40006,'登录失败'],
        40010 => [40010,'标签已存在，请重试'],
        40011 => [40011,'标签的层级ID错误，请重试'],
        40012 => [40012,'标签ID错误，只能删除三级标签下的用户'],
        40013 => [40013,'标签ID错误，目前不支持删除一级标签']
    ];
    ///促销活动服务50001开始
    public static $errorCodeActivityList = [
        50001 => [50001, '活动数据保持失败，请稍后再试'],
        50002 => [50002, '已添加首页弹窗展示活动'],
    ];
    ///卡券服务60001开始
    public static $errorCodeCouponsList = [
        60001 => [60001, '卡券数据保持失败，请稍后再试'],
        60002 => [60002, '礼包已失效，不可重复设置'],
        60003 => [60003, '已存在相同礼包'],
        60004 => [60004, '礼包时间冲突'],
        60005 => [60005, '无效的优惠券'],
        60006 => [60006, '优惠券总数量错误'],
        60007 => [60007, '礼包无法领取'],
        60008 => [60008, '已达到领取上限'],
        60009 => [60009, '该优惠券已被抢完'],
        60010 => [60010, '优惠已过期'],
        60011 => [60011, '优惠券单人领取次数冲突'],
		60012 => [60012, '不可使用该优惠码']
    ];
    ///评论服务70001开始
    public static $errorCodeCommentList = [
        70001 => [70001, '评论数据保持失败，请稍后再试'],
    ];
    ///搜索服务80001开始
    public static $errorCodeSearchList = [
        80001 => [8001, '搜索数据保持失败，请稍后再试'],
    ];
    ///数据看板dashboard服务90001开始
    public static $errorCodeDashBoardList = [
        90001 => [90001, '看板数据保持失败，请稍后再试'],
    ];

    //积分|金币服务从100001开始
    public static $errorCodeProperrtyBoardList = [
        100001 => [100001, '保存失败，请稍后再试'],
        100002 => [100002, '今日已签到'],
        100003 => [100003, '领取积分失败'],
        100004 => [100004, '已达到今日领取上限'],
        100005 => [100005, '签到领取积分规则已存在'],
        100006 => [100006, '已领取过，不可重复领取'],
        100007 => [100007, '完善信息领取积分规则已存在'],
        100008 => [100008, ' 必须传递 SKU|SPU 其中一个参数'],
        100009 => [100009, 'SKU|SPU不可同时传递'],
        100010 => [100010, '浏览现货商品SKU的领取积分规则已存在'],
        100011 => [100011, '浏览现货商品SPU的领取积分规则已存在'],
        100012 => [100012, '浏览专题的领取积分规则已存在'],
        100013 => [100013, '浏览新上商品SKU的领取积分规则已存在'],
        100014 => [100014, '浏览新上商品SPU的领取积分规则已存在'],
        100015 => [100015, '分享的领取积分规则已存在'],
        100016 => [100016, '购买所有商品的领取积分规则已存在'],
        100017 => [100017, '商品评论的领取积分规则已存在'],
        100018 => [100018, '应用市场评论的领取积分规则已存在'],
        100019 => [100019, '购买指定商品的领取积分规则已存在'],
        100020 => [100020, '全体用户发放的领取积分规则已存在'],
        100021 => [100021, '分组用户发放的领取积分规则已存在'],
        100022 => [100022, '个体用户发放的领取积分规则已存在'],
        100023 => [100023, '用户发放的领取积分规则已存在'],
        100024 => [100024, '积分余额不足'],
        100025 => [100025, '兑换失败'],
        100026 => [100026, '关卡生效后不可失效'],
        100027 => [100027, '关卡生效后不可编辑'],
        100028 => [100028, '签到失败，请稍后再试'],
        100029 => [100029, '金币余额不足'],
    ];

    /**
     * Return API interface exception.
     * API控制器返回错误码及信息方法
     * @param $code
     * @throws ApiException
     */
    public function returnException($code): void
    {
        //如果不存在错误码则抛出异常
        if (!array_key_exists($code, $this->errorCodeList)) {
            throw new ApiException('未找到正确的错误码', 500);
        }
        //抛出错误异常
        throw new ApiException($this->errorCodeList[$code], $code);
    }
}
